Revit 2026 API

# MassSurfaceDataSkylightWidth Property

---

The length dimension to be used for the sides of each individual square skylight produced in the grid of auto-generated skylights.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double SkylightWidth { get; set; }
```
```vb
Public Property SkylightWidth As Double
	Get
	Set
```
```cpp
public:
property double SkylightWidth {
	double get ();
	void set (double value);
}
```
```fsharp
member SkylightWidth : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The skylight width is less than eight inches. |

#### Reference

MassSurfaceData Class

Autodesk.Revit.DB.Analysis Namespace